import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        //  Используя Switch и оператор if else написать программу,
        //      проверяющую  является ли принятый со сканера символ согласной
        //      буквой английского алфавита, гласной буквой английского алфавита либо не
        //      является буквой английского алфавита.

        //Написать простой калькулятор,  выполняющий сложение, вычитание, умножение
        // и деление в зависимости от ввода пользователем соответствующего действия.
        // Программа принимает два  числа и затем спрашивает какое действие необходимо
        // произвести. Результат выводится на экран




    }
}