public class WhileNumbers {
    public static void main(String[] args) {
        //С помощью цикла while написать программу, печатающую цифры от 1 до 10
        int a=1;
        while (a<11) {
            System.out.println(a);
            a++;
        }
    }
}
