public class WhileSum {
    public static void main(String[] args) {
        //С помощью цикла while написать программу, считающую и выводящую на экран сумму цифр от одного до 5
        int a= 1;
        int result = 0;
        while (a<=5) {
            result = result + a;
            a++;
        }
            System.out.println(result);


        }


        }


